{"content": "<div id=\"problemtext\"><h2><a href=\"https://gpe3.acm-icpc.tw/domjudge2/pct/showproblem.php?probid=10409&amp;cid=5\" target=\"_blank\">10409:A mid-summer night&#8217;s dream </a></h2>Time Limit: 3 sec<p></p><h3 style=\"text-align:left\">Description</h3><p>This is year 2200AD. Science has progressed a lot in two hundred years. Two hundred years is mentioned here because this problem is being sent back to 2000AD with the help of time machine. Now it is possible to establish direct connection between man and computer CPU. People can watch other people&#8217;s dream on 3D displayer (That is the monitor today) as if they were watching a movie. One problem in this century is that people have become so dependent on computers that their analytical ability is approaching zero. Computers can now read problems and solve them automatically. But they can solve only difficult problems. There are no easy problems now. Our chief scientist is in great trouble as he has forgotten the number of his combination lock. For security reasons computers today cannot solve combination lock related problems. In a mid-summer night the scientist has a dream where he sees a lot of unsigned integer numbers flying around. He records them with the help of his computer, Then he has a clue that if the numbers are (X1, X2,&#160;&#160; &#8230;&#160; , Xn) he will have to find an integer number <strong>A</strong> (This <strong>A</strong> is the combination lock code) such that</p>&#13;\n<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;</p>&#13;\n<p>&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160;&#160; (|X1-A| + |X2-A| + &#8230; &#8230; + |Xn-A|) is minimum.</p><h3 style=\"text-align:left\">Input</h3><p>Input will contain several blocks. Each block will start with a number n (0&lt;n&lt;=1000000) indicating how many numbers he saw in the dream. Next there will be n numbers. All the numbers will be less than 65536. The input will be terminated by end of file.</p><h3 style=\"text-align:left\">Output</h3><p>For each set of input there will be one line of output. That line will contain the minimum possible value for A. Next it will contain how many numbers are there in the input that satisfy the property of A (The summation of absolute deviation from A is minimum). And finally you have to print how many possible different integer values are there for A (these values need not be present in the input). These numbers will be separated by single space.</p><hr /><div id=\"sampleinputoutput\"><table class=\"inputoutput\"><tr><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Input</h3></td><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Output</h3></td></tr><tr></tr><tr class=\"inputoutput\"><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">2&#13;\n10&#13;\n10&#13;\n4&#13;\n1&#13;\n2&#13;\n2&#13;\n4</pre></td><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">10 2 1&#13;\n2 2 1</pre></td></tr></table></div><hr /><table><tr><td>Keyword:</td><td></td></tr></table></div></body>\n</html><html xmlns=\"http://www.w3.org/1999/xhtml\"></html>"}