{"content": "<div id=\"problemtext\"><h2><a href=\"https://gpe3.acm-icpc.tw/domjudge2/pct/showproblem.php?probid=10421&amp;cid=5\" target=\"_blank\">10421:All You Need Is Love  </a></h2>Time Limit: 3 sec<p></p><h3 style=\"text-align:left\">Description</h3><p>There was invented a new powerfull gadget by the International Beautifull Machines corporation called the love machine! Given a string made of binary digits, the love machine answers if it's made only of love, that is, if all you need is love to build that string. The definition of love for the love machine is another string of binary digits, given by a human operator. Let's say we have a string L which represents \"love\" and we give a string S for the love machine. We say that all you need is love to build S, if we can repeatly subtract L from S until we reach L. The subtraction defined here is the same arithmetic subtraction in base 2. By this definition it's easy to see that if L &gt; S (in binary), then S is not made of love. If S = L then S is obvious made of love.</p>&#13;\n<p>Let's see an example. Supose S = \"11011\" and L = \"11\". If we reapetly subtract L from S, we get: 11011, 11000, 10101, 10010, 1111, 1100, 1001, 110, 11. So, given this L, all you need is love to build S. Because of some limitations of the love machine, there can be no string with leading zeroes. That is, \"0010101\", \"01110101\", \"011111\" etc. are invalid strings. Strings which have only one digit are also invalid (it's another limitation).</p>&#13;\n<p>Your task in this problem is: given two valid binary strings, S1 and S2, find if it's possible to have a valid string L such that both S1 and S2 can be made only of L (i.e. given two valid strings S1 and S2, find if there exists at least one valid string L such as both S1 and S2 are made only of L). For instance, for S1 = 11011 and S2 = 11000, we can have L = 11 such that S1 and S2 are both made only of L (as we can see in the example above).</p><h3 style=\"text-align:left\">Input</h3><p>The first line of input is a positive integer N &lt; 10000 which stands for the number of teste cases. Then, 2*N lines will follow. Each pair of lines consists in one teste case. Each line of the pair stands for each string (S1 and S2) to be entered as an input for the love machine. No string will have more than 30 characters. You can assume that all strings in the input will be valid acording to the rules above.</p><h3 style=\"text-align:left\">Output</h3><p>For each string pair, you must print one of the following messages:</p>&#13;\n<pre>Pair #p: All you need is love!&#13;\nPair #p: Love is not all you need!&#13;\n</pre>&#13;\n<p>Where p stands for the pair number (starting from 1). You should print the first message if there exists at least one valid string L such as both S1 and S2 can be made only of L. Otherwise, print the second line.</p><hr /><div id=\"sampleinputoutput\"><table class=\"inputoutput\"><tr><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Input</h3></td><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Output</h3></td><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Download Sample Input/Output</h3></td></tr><tr></tr><tr class=\"inputoutput\"><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">5&#13;\n11011&#13;\n11000&#13;\n11011&#13;\n11001&#13;\n111111&#13;\n100&#13;\n1000000000&#13;\n110&#13;\n1010&#13;\n100&#13;\n</pre></td><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">Pair #1: All you need is love!&#13;\nPair #2: Love is not all you need!&#13;\nPair #3: Love is not all you need!&#13;\nPair #4: All you need is love!&#13;\nPair #5: All you need is love!&#13;\n</pre></td><td class=\"inputoutput\"><a>input</a>, <a>output</a><br /></td></tr></table></div><hr /><table><tr><td>Keyword:</td><td>number theory</td></tr></table></div></body>\n</html><html xmlns=\"http://www.w3.org/1999/xhtml\"></html>"}