{"content": "<div id=\"problemtext\"><h2><a href=\"https://gpe3.acm-icpc.tw/domjudge2/pct/showproblem.php?probid=10432&amp;cid=5\" target=\"_blank\">10432:Mine Sweeper</a></h2>Time Limit: 3 sec<p></p><h3 style=\"text-align:left\">Description</h3><p style=\"text-align: justify;\">The game <em>Minesweeper</em> is played on an <em>n</em> by <em>n</em> grid. In this grid are hidden <em>m</em> mines, each at a distinct grid location. The player repeatedly touches grid positions. If a position with a mine is touched, the mine explodes and the player loses. If a positon not containing a mine is touched, an integer between 0 and 8 appears denoting the number of adjacent or diagonally adjacent grid positions that contain a mine. A sequence of moves in a partially played game is illustrated below.</p>&#13;\n<p><img src=\"/question_snapshots/assets/c4ac8f5a0160fcd755cdf8c1169397e4.gif\" alt=\"\" /></p>&#13;\n<p>Here, <em>n</em> is 8, <em>m</em> is 10, blank squares represent the integer 0, raised squares represent unplayed positions, and the figures resembling asterisks represent mines. The leftmost image represents the partially played game. From the first image to the second, the player has played two moves, each time choosing a safe grid position. From the second image to the third, the player is not so lucky; he chooses a position with a mine and therefore loses. The player wins if he continues to make safe moves until only <em>m</em> unplayed positions remain; these must necessarily contain the mines.</p>&#13;\n<p>Your job is to read the information for a partially played game and to print the corresponding board.</p><h3 style=\"text-align:left\">Input</h3><p style=\"text-align: justify;\">The first line of input contains how many game you have to solved followed by blank line. The first line of each description contain a single postitive integer <em>n &lt;= 10</em>. The next n lines represent the positions of the mines. Each line represents the contents of a row using n characters: a period indicates an unmined positon while an asterisk indicates a mined position. The next n lines are each n characters long: touched positions are denoted by an x, and untouched positions by a period. The sample input corresponds to the middle figure above. There is a blank line between each consecutive game description.&#160;</p><h3 style=\"text-align:left\">Output</h3><p style=\"text-align: justify;\">Your output should represent the board, with each position filled in appropriately. Positions that have been touched and do not contain a mine should contain an integer between 0 and 8. If a mine has been touched, all positions with a mine should contain an asterisk. All other positions should contain a period. Print a blank line between each consecutive 2 consecutive data sets.</p><hr /><div id=\"sampleinputoutput\"><table class=\"inputoutput\"><tr><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Input</h3></td><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Output</h3></td></tr><tr></tr><tr class=\"inputoutput\"><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">1&#13;\n&#13;\n8&#13;\n...**..*&#13;\n......*.&#13;\n....*...&#13;\n........&#13;\n........&#13;\n.....*..&#13;\n...**.*.&#13;\n.....*..&#13;\nxxx.....&#13;\nxxxx....&#13;\nxxxx....&#13;\nxxxxx...&#13;\nxxxxx...&#13;\nxxxxx...&#13;\nxxx.....&#13;\nxxxxx...</pre></td><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">001.....&#13;\n0013....&#13;\n0001....&#13;\n00011...&#13;\n00001...&#13;\n00123...&#13;\n001.....&#13;\n00123...</pre></td></tr></table></div><hr /><table><tr><td>Source: </td><td>UAV</td></tr><tr><td>URL: </td><td><a>http://uva.onlinejudge.org/external/102/10279.html</a></td></tr><tr><td>Keyword:</td><td></td></tr></table></div></body>\n</html><html xmlns=\"http://www.w3.org/1999/xhtml\"></html>"}