{"content": "<div id=\"problemtext\"><h2><a href=\"https://gpe3.acm-icpc.tw/domjudge2/pct/showproblem.php?probid=10533&amp;cid=5\" target=\"_blank\">10533:The Trip</a></h2>Time Limit: 30 sec<p></p><h3 style=\"text-align:left\">Description</h3><p>A number of students are members of a club that travels annually to exotic locations. Their destinations in the past have included Indianapolis, Phoenix, Nashville, Philadelphia, San Jose, and Atlanta. This spring they are planning a trip to Eindhoven.</p>&#13;\n<p>The group agrees in advance to share expenses equally, but it is not practical to have them share every expense as it occurs. So individuals in the group pay for particular things, like meals, hotels, taxi rides, plane tickets, etc. After the trip, each student's expenses are tallied and money is exchanged so that the net cost to each is the same, to within one cent. In the past, this money exchange has been tedious and time consuming. Your job is to compute, from a list of expenses, the minimum amount of money that must change hands in order to equalize (within a cent) all the students' costs.</p>&#13;\n<h3>The Input</h3>&#13;\n<p>Standard input will contain the information for several trips. The information for each trip consists of a line containing a positive integer, n, the number of students on the trip, followed by n lines of input, each containing the amount, in dollars and cents, spent by a student. There are no more than 1000 students and no student spent more than $10,000.00. A single line containing 0 follows the information for the last trip.</p>&#13;\n<h3>The Output</h3>&#13;\n<p>For each trip, output a line stating the total amount of money, in dollars and cents, that must be exchanged to equalize the students' costs.</p>&#13;\n<h3>Sample Input</h3>&#13;\n<pre>3<br />10.00<br />20.00<br />30.00<br />4<br />15.00<br />15.01<br />3.00<br />3.01<br />0</pre>&#13;\n<h3>Output for Sample Input</h3>&#13;\n<pre>$10.00<br />$11.99</pre><hr /><table><tr><td>Source: </td><td>http://uva.onlinejudge.org/external/101/10137.html</td></tr><tr><td>Keyword:</td><td>ad hoc</td></tr></table></div></body>\n</html><html xmlns=\"http://www.w3.org/1999/xhtml\"></html>"}