{"content": "<div id=\"problemtext\"><h2><a href=\"https://gpe3.acm-icpc.tw/domjudge2/pct/showproblem.php?probid=10579&amp;cid=5\" target=\"_blank\">10579:Hay Points</a></h2>Time Limit: 30 sec<p></p><h3 style=\"text-align:left\">Description</h3><p><img src=\"/question_snapshots/assets/96edbf7b67bb928462f435aa4203d4f8.jpg\" alt=\"\" align=\"right\" /></p>&#13;\n<h2>&#160;</h2>&#13;\n<p>Each employee of a bureaucracy has a <em>job description</em>- a few paragraphs that describe the responsibilities of the job. The employee's job description, combined with other factors, such as seniority, is used to determine his or her salary.</p>&#13;\n<p>The <em>Hay Point</em>system frees the Human Resources department from having to make an intelligent judgement as to the value of the employee; the job description is merely scanned for words and phrases that indicate responsibility. In particular, job descriptions that indicate control over a large budget or management over a large number of people yield high Hay Point scores.</p>&#13;\n<p>You are to implement a simplified Hay Point system. You will be given a Hay Point dictionary and a number of job descriptions. For each job description you are to compute the salary associated with the job, according to the system.</p><h3 style=\"text-align:left\">Input</h3><p><span>The first line of input contains 2 positive integers:&#160;</span><em>m , the number of words in the Hay Point dictionary, and&#160;<em>n , the number of job descriptions.&#160;<em>m</em>&#160;lines follow; each contains a word (a string of up to 16 lower-case letters) and a dollar value (a real number between 0 and 1,000,000). Following the dictionary are the&#160;<em>n</em>job descriptions. Each job description consists of one or more lines of text; for your convenience the text has been converted to lower case and has no characters other than letters, numbers, and spaces. Each job description is terminated by a line containing a period.</em></em></p><h3 style=\"text-align:left\">Output</h3><p>For each job description, output the corresponding salary computed as the sum of the Hay Point values for all words that appear in the description. Words that do not appear in the dictionary have a value of 0.</p><hr /><div id=\"sampleinputoutput\"><table class=\"inputoutput\"><tr><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Input</h3></td><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Output</h3></td></tr><tr></tr><tr class=\"inputoutput\"><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">7 2&#13;\nadminister 100000&#13;\nspending 200000&#13;\nmanage 50000&#13;\nresponsibility 25000&#13;\nexpertise 100&#13;\nskill 50&#13;\nmoney 75000&#13;\nthe incumbent will administer the spending of kindergarden milk money&#13;\nand exercise responsibility for making change he or she will share&#13;\nresponsibility for the task of managing the money with the assistant&#13;\nwhose skill and expertise shall ensure the successful spending exercise&#13;\n.&#13;\nthis individual must have the skill to perform a heart transplant and&#13;\nexpertise in rocket science&#13;\n.</pre></td><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">700150&#13;\n150</pre></td></tr></table></div><hr /><table><tr><td>Source: </td><td>http://uva.onlinejudge.org/external/102/10295.html</td></tr><tr><td>Keyword:</td><td>ad hoc</td></tr></table></div></body>\n</html><html xmlns=\"http://www.w3.org/1999/xhtml\"></html>"}