{"content": "<div id=\"problemtext\"><h2><a href=\"https://gpe3.acm-icpc.tw/domjudge2/pct/showproblem.php?probid=10602&amp;cid=5\" target=\"_blank\">10602:Longest Paths </a></h2>Time Limit: 3 sec<p></p><h3 style=\"text-align:left\">Description</h3><p>It is a well known fact that some people do not have their social abilities completely enabled. One example is the lack of talent for calculating distances and intervals of time. This causes some people to always choose the longest way to go from one place to another, with the consequence that they are late to whatever appointments they have, including weddings and programming contests. This can be highly annoying for their friends.</p>&#13;\n<p>C&#233;sar has this kind of problem. When he has to go from one point to another he realizes that he has to visit many people, and thus always chooses the longest path. One of C&#233;sar's friends, Felipe, has understood the nature of the problem. Felipe thinks that with the help of a computer he might be able to calculate the time that C&#233;sar is going to need to arrive to his destination. That way he could spend his time in something more enjoyable than waiting for C&#233;sar.</p>&#13;\n<p>&#160;</p>&#13;\n<p><br />Your goal is to help Felipe developing a program that computes the length of the longest path that can be constructed in a given graph from a given starting point (C&#233;sar's residence). You can assume that the graph has no cycles (there is no path from any node to itself), so C&#233;sar will reach his destination in a finite time. In the same line of reasoning, nodes are not considered directly connected to themselves.</p><h3 style=\"text-align:left\">Input</h3><p>The input consists of a number of cases. The first line on each case contains a positive number <em>n</em> (<img src=\"/question_snapshots/assets/767d1142243a11def02fd0d29e0c31fb.gif\" border=\"0\" alt=\"$1  &lt; n \\le 100$\" width=\"96\" height=\"30\" align=\"middle\" />) that specifies the number of points that C&#233;sar might visit (i.e., the number of nodes in the graph).</p>&#13;\n<p>A value of <em>n</em> = 0 indicates the end of the input.</p>&#13;\n<p><br />After this, a second number <em>s</em> is provided, indicating the starting point in C&#233;sar's journey (<img src=\"/question_snapshots/assets/a56be0c829fa7aaede66a3141f65193c.gif\" alt=\"\" width=\"78\" height=\"30\" />). Then, you are given a list of pairs of places <em>p</em> and <em>q</em>, one pair per line, with the places on each line separated by white-space. The pair `` <!-- MATH: $1 \\le s \\le n$ --><img src=\"/question_snapshots/assets/2c6003ffdf0cf43af2ddf964e9420b8a.gif\" border=\"0\" alt=\"$p \\  q$\" width=\"27\" height=\"30\" align=\"middle\" />\" indicates that C&#233;sar can visit <em>q</em> after <em>p</em>.</p>&#13;\n<p>A pair of zeros (``<tt>0 0</tt>\") indicates the end of the case.</p>&#13;\n<p>&#160;<br />As mentioned before, you can assume that the graphs provided will not be cyclic.</p><h3 style=\"text-align:left\">Output</h3><p>For each test case you have to find the length of the longest path that begins at the starting place. You also have to print the number of the final place of such longest path. If there are several paths of maximum length, print the final place with smallest number.</p>&#13;\n<p>&#160;<br />Print a new line after each test case.</p><hr /><div id=\"sampleinputoutput\"><table class=\"inputoutput\"><tr><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Input</h3></td><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Output</h3></td></tr><tr></tr><tr class=\"inputoutput\"><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">2&#13;\n1&#13;\n1 2&#13;\n0 0&#13;\n5&#13;\n3&#13;\n1 2&#13;\n3 5&#13;\n3 1&#13;\n2 4&#13;\n4 5&#13;\n0 0&#13;\n5&#13;\n5&#13;\n5 1&#13;\n5 2&#13;\n5 3&#13;\n5 4&#13;\n4 1&#13;\n4 2&#13;\n0 0&#13;\n0&#13;\n</pre></td><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">Case 1: The longest path from 1 has length 1, finishing at 2.&#13;\n&#13;\nCase 2: The longest path from 3 has length 4, finishing at 5.&#13;\n&#13;\nCase 3: The longest path from 5 has length 2, finishing at 1.&#13;\n</pre></td></tr></table></div><hr /><table><tr><td>Keyword:</td><td></td></tr></table></div></body>\n</html><html xmlns=\"http://www.w3.org/1999/xhtml\"></html>"}