{"content": "<div id=\"problemtext\"><h2><a href=\"https://gpe3.acm-icpc.tw/domjudge2/pct/showproblem.php?probid=10606&amp;cid=5\" target=\"_blank\">10606:  How Big Is It? </a></h2>Time Limit: 30 sec<p></p><h3 style=\"text-align:left\">Description</h3><p>Ian's going to California, and he has to pack his things, including his collection of circles. Given a set of circles, your program must find the smallest rectangular box in which they fit. All circles must touch the bottom of the box. The figure below shows an acceptable packing for a set of circles (although this may not be the optimal packing for these particular circles). Note that in an ideal packing, each circle should touch at least one other circle (but you probably figured that out).</p>&#13;\n<p>&#160;</p>&#13;\n<p><img src=\"/question_snapshots/assets/e1699c549cdbfd5e01dea30921f1e662.gif\" alt=\"\" /></p><h3 style=\"text-align:left\">Input</h3><p>The first line of input contains a single positive decimal integer n, n&lt;=50. This indicates the number of lines which follow. The subsequent n lines each contain a series of numbers separated by spaces. The first number on each of these lines is a positive integer m, m&lt;=8, which indicates how many other numbers appear on that line. The next m numbers on the line are the radii of the circles which must be packed in a single box. These numbers need not be integers.</p><h3 style=\"text-align:left\">Output</h3><p>For each data line of input, excluding the first line of input containing n, your program must output the size of the smallest rectangle which can pack the circles. Each case should be output on a separate line by itself, with three places after the decimal point. Do not output leading zeroes unless the number is less than 1, e.g. 0.543.</p><hr /><div id=\"sampleinputoutput\"><table class=\"inputoutput\"><tr><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Input</h3></td><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Output</h3></td></tr><tr></tr><tr class=\"inputoutput\"><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">3&#13;\n3 2.0 1.0 2.0&#13;\n4 2.0 2.0 2.0 2.0&#13;\n3 2.0 1.0 4.0&#13;\n</pre></td><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">9.657&#13;\n16.000&#13;\n12.657&#13;\n</pre></td></tr></table></div><hr /><table><tr><td>Keyword:</td><td></td></tr></table></div></body>\n</html><html xmlns=\"http://www.w3.org/1999/xhtml\"></html>"}