{"content": "<div id=\"problemtext\"><h2><a href=\"https://gpe3.acm-icpc.tw/domjudge2/pct/showproblem.php?probid=10607&amp;cid=5\" target=\"_blank\">10607:Joseph's Cousin</a></h2>Time Limit: 60 sec<p></p><h3 style=\"text-align:left\">Description</h3><p style=\"text-align: justify;\">The Joseph&#8217;s problem is notoriously known. For those who are not familiar with the problem, among n people numbered 1,2&#8230;n, standing in circle every mth is going to be executed and only the life of the last remaining person will be saved. Joseph was smart enough to choose the position of the last remaining person, thus saving his life to give the message about the incident. Although many good programmers have been saved since Joseph spread out this information, Joseph&#8217;s Cousin introduced a new variant of the malignant game. This insane character is known for its barbarian ideas and wishes to clean up the world from silly programmers. We had to infiltrate some the agents of the ACM in order to know the process in this new mortal game. In order to save yourself from this evil practice, you must develop a tool capable of predicting which person will be saved.</p>&#13;\n<p style=\"text-align: justify;\"><strong>The Destructive Process</strong></p>&#13;\n<p style=\"text-align: justify;\">The persons are eliminated in a very peculiar order; m is a dynamical variable, which each time takes a different value corresponding to the prime numbers&#8217; succession (2,3,5,7&#8230;). So in order to kill the ith person, Joseph&#8217;s cousin counts up to the ith prime.</p><h3 style=\"text-align:left\">Input</h3><p>It consists of separate lines containing n [1..3501], and finishes with a 0.</p><h3 style=\"text-align:left\">Output</h3><p>The output will consist in separate lines containing the position of the person which life will be saved.</p><hr /><div id=\"sampleinputoutput\"><table class=\"inputoutput\"><tr><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Input</h3></td><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Output</h3></td></tr><tr></tr><tr class=\"inputoutput\"><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">6&#13;\n0&#13;\n</pre></td><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">4&#13;\n</pre></td></tr></table></div><hr /><table><tr><td>Keyword:</td><td></td></tr></table></div></body>\n</html><html xmlns=\"http://www.w3.org/1999/xhtml\"></html>"}