{"content": "<div id=\"problemtext\"><h2><a href=\"https://gpe3.acm-icpc.tw/domjudge2/pct/showproblem.php?probid=10605&amp;cid=5\" target=\"_blank\">10605:Count the Trees </a></h2>Time Limit: 3 sec<p></p><h3 style=\"text-align:left\">Description</h3><p>Another common social inability is known as ACM (Abnormally Compulsive Meditation). This psychological disorder is somewhat common among programmers. It can be described as the temporary (although frequent) loss of the faculty of speech when the whole power of the brain is applied to something extremely interesting or challenging. Juan is a very gifted programmer, and has a severe case of ACM (he even participated in an ACM world championship a few months ago). Lately, his loved ones are worried about him, because he has found a new exciting problem to exercise his intellectual powers, and he has been speechless for several weeks now. The problem is the determination of the number of different labeled binary trees that can be built using exactly n different elements. For example, given one element A, just one binary tree can be formed (using A as the root of the tree). With two elements, A and B, four different binary trees can be created, as shown in the figure. If you are able to provide a solution for this problem, Juan will be able to talk again, and his friends and family will be forever grateful.</p>&#13;\n<p>&#160;<img src=\"/question_snapshots/assets/377b453cf22d113bf7f7c3a746b2a22d.gif\" border=\"0\" alt=\"\\begin{picture}(400,90)(50,0) \\put(115,62){A} \\put(75,10){B} \\put(120,60){\\vecto... ...}} \\put(365,62){B} \\put(405,10){A} \\put(370,60){\\vector(1,-1){40}} \\end{picture}\" width=\"538\" height=\"96\" align=\"bottom\" /></p><h3 style=\"text-align:left\">Input</h3><p>The input will consist of several input cases, one per line. Each input case will be specified by the number n ( 1 &#8804; n &#8804; 300 ) of different elements that must be used to form the trees. A number 0 will mark the end of input and is not to be processed.</p><h3 style=\"text-align:left\">Output</h3><p>For each input case print the number of binary trees that can be built using the n elements, followed by a newline character.</p><hr /><div id=\"sampleinputoutput\"><table class=\"inputoutput\"><tr><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Input</h3></td><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Output</h3></td></tr><tr></tr><tr class=\"inputoutput\"><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">1&#13;\n2&#13;\n10&#13;\n25&#13;\n0&#13;\n</pre></td><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">1&#13;\n4&#13;\n60949324800&#13;\n75414671852339208296275849248768000000&#13;\n</pre></td></tr></table></div><hr /><table><tr><td>Keyword:</td><td></td></tr></table></div></body>\n</html><html xmlns=\"http://www.w3.org/1999/xhtml\"></html>"}