{"content": "<div id=\"problemtext\"><h2><a href=\"https://gpe3.acm-icpc.tw/domjudge2/pct/showproblem.php?probid=10732&amp;cid=5\" target=\"_blank\">10732:Snow Clearing</a></h2>Time Limit: 30 sec<p></p><h3 style=\"text-align:left\">Description</h3><p><img src=\"/question_snapshots/assets/466ced87b79bdac2fb274a349770c9e4.jpg\" alt=\"\" align=\"right\" /></p>&#13;\n<p><span style=\"font-size: 10px;\">As the days become shorter and the nights become longer we turn our thoughts to snow clearing. Due to budget cuts, the Big Noisy City has exactly one snow plow. The plow can clear exactly one lane of a road in a single pass. Whenever there is snow on the ground, the plow departs from its hangar and tours the city, plowing as it goes. What is the minimum time that the plow needs to clear every lane of every road?</span></p>&#13;\n<p>The first line of input is the number of test cases, followed by a blank line. Then the input contains two integers: the x,y coordinates of the hangar (in metres). Up to 100 lines follow. Each gives the coordinates (in metres) of the beginning and end of a street. All roads are perfectly straight, with one lane in each direction. The plow can turn any direction (including a U-turn) at any intersection, and can turn around at the end of any street. The plow travels at 20 km/h if it is plowing, and 50 km/h if the lane it is driving on has already been plowed. It is possible to reach all streets from the hangar. There is a blank line between each consecutive test case.</p>&#13;\n<p>Your output should be the time, in hours and minutes, required to clear the streets and return to the hangar. Round to the nearest minute&#160; for each data set. Print a blank line between 2 consecutive data sets.</p>&#13;\n<h3>Sample Input</h3>&#13;\n<pre>1&#13;\n&#13;\n0 0&#13;\n0 0 10000 10000&#13;\n5000 -10000 5000 10000&#13;\n5000 10000 10000 10000&#13;\n</pre>&#13;\n<h3>Output for Sample Input</h3>&#13;\n<pre>3:55&#13;\n</pre><hr /><table><tr><td>Source: </td><td>http://uva.onlinejudge.org/external/102/10203.html</td></tr><tr><td>Keyword:</td><td>graph theory</td></tr></table></div></body>\n</html><html xmlns=\"http://www.w3.org/1999/xhtml\"></html>"}