{"content": "<div id=\"problemtext\"><h2><a href=\"https://gpe3.acm-icpc.tw/domjudge2/pct/showproblem.php?probid=11058&amp;cid=5\" target=\"_blank\">11058:Exact Sum\n</a></h2>Time Limit: 1 sec<p></p><h3 style=\"text-align:left\">Description</h3><h1 align=\"center\">&#160;</h1>&#13;\n<p style=\"text-align: justify;\">Peter received money from his parents this week and wants to spend it all buying books. But he does not read a book so fast, because he likes to enjoy every single word while he is reading. In this way, it takes him a week to finish a book.</p>&#13;\n<p style=\"text-align: justify;\">As Peter receives money every two weeks, he decided to buy two books, then he can read them until receive more money. As he wishes to spend all the money, he should choose two books whose prices summed up are equal to the money that he has. It is a little bit difficult to find these books, so Peter asks your help to find them.</p>&#13;\n<h2>Input</h2>&#13;\n<p style=\"text-align: justify;\">Each test case starts with <strong>2 &#8804; N &#8804; 10000</strong>, the number of available books. Next line will have <strong>N</strong> integers, representing the price of each book, a book costs less than <strong>1000001</strong>. Then there is another line with an integer <strong>M</strong>, representing how much money Peter has. Each test case is separated by a blank line. The input is terminated by end of file (EOF).</p>&#13;\n<h2>Output</h2>&#13;\n<p style=\"text-align: justify;\">For each test case you must print the message: <strong>Peter should buy books whose prices are i and j.</strong>, where <strong>i</strong> and <strong>j</strong> are the prices of the books whose sum is equal do <strong>M</strong> and <strong>i &#8804; j</strong>. You can consider that is always possible to find a solution, if there are multiple solutions print the solution that minimizes the difference between the prices <strong>i</strong> and <strong>j</strong>. After each test case you must print a blank line.</p>&#13;\n<h2>Sample Input</h2>&#13;\n<pre>2&#13;\n40 40&#13;\n80&#13;\n&#13;\n5&#13;\n10 2 6 8 4&#13;\n10&#13;\n</pre>&#13;\n<h2>Sample Output</h2>&#13;\n<pre>Peter should buy books whose prices are 40 and 40.&#13;\n&#13;\nPeter should buy books whose prices are 4 and 6.&#13;\n&#13;\n</pre>&#13;\n<hr />&#13;\n<p><strong>Problem setter: S&#233;rgio Queiroz de Medeiros</strong></p><hr /><table><tr><td>Source: </td><td>http://uva.onlinejudge.org/external/110/11057.html</td></tr><tr><td>Keyword:</td><td>ad hoc</td></tr></table></div></body>\n</html><html xmlns=\"http://www.w3.org/1999/xhtml\"></html>"}