{"content": "<div id=\"problemtext\"><h2><a href=\"https://gpe3.acm-icpc.tw/domjudge2/pct/showproblem.php?probid=2009-02&amp;cid=5\" target=\"_blank\">2009-02:Line Overlap Problem</a></h2>Time Limit: 30 sec<p></p><h3 style=\"text-align:left\">Description</h3><p style=\"text-align: justify;\">Calculating the overlapping of line segments is the fundamental problem of computational geometry. In this problem, we consider the simplified line overlap problem &#8211; how to calculate the overlapping length of horizontal line segments.</p>&#13;\n<p style=\"text-align: justify;\">In this problem, all horizontal lines have no <em>y-</em>coordinate, and they can be regarded to have the same <em>y</em>-coordinate. Thus the overlapping check can be achieved by only examining the <em>x</em>-coordinates of two endpoints of every line segment. You have to identify all two line pairs with overlap and sum up the total overlapping length. For example, there are three line segments and any two line segments overlap. Thus you have to find three overlapping lengths and then sum up these three overlapping lengths. Two-loop codes can simply solve this problem, but its time complexity is O(<em>n<sup>2</sup></em>), where <em>n</em> is the number of line segments. The runtime will increase substantially as <em>n</em> increases. The time complexity of the optimal solution to this problem is O(<em>nlogn</em>). All benchmarks in this contest can be solved within 0.156 second on the contest platform. Please design an algorithm to calculate the overlapping length of a horizontal line set and guarantee to solve each benchmark within 2 seconds (including 2 seconds). Any test for a benchmark over 2 seconds is regarded to fail.</p><h3 style=\"text-align:left\">Input</h3><p style=\"text-align: justify;\">The input consists of N (N &lt; 200000) datasets representing horizontal lines, followed by a line which contains only a single &#8216;.&#8217; (period). There are two integers i and j in a line, where the first integer i (i &lt; 100000) is the <em>x</em>-coordinate of left endpoint and the second integer j (j &lt; 100000) is the <em>x-</em>coordinate of right endpoint. Two integers are separated by space character. Notably, the number of space characters is not fixed, do not use space-sensitive instruction to read input file.</p>&#13;\n<p style=\"text-align: justify;\">For example, the following input dataset is described as follows.</p>&#13;\n<p>75&#160; 325</p>&#13;\n<p>5&#160; 120</p>&#13;\n<p>100&#160; 255</p>&#13;\n<p>325&#160; 500</p>&#13;\n<p style=\"text-align: justify;\">.</p>&#13;\n<p style=\"text-align: justify;\">There are four horizontal line segments and their input content is as follows. <em>overlap&#173;_len</em>(<em>i</em>,<em>j</em>) is the overlapping length of line <em>i</em> and line <em>j</em>. The total overlapping length for these four line segments is: <em>overlap&#173;_len</em>(1,2)+<em> overlap&#173;_len</em>(1,3)+<em> overlap&#173;_len</em>(2,3)=45+155+20=220. Notably, the overlapping length between lines 1 and 4 is 0.</p><h3 style=\"text-align:left\">Output</h3><p style=\"text-align: justify;\">Please print out the total overlapping length of the line set.<strong> </strong>Since the total overlapping length may exceed the maximum value of a 32bits integer, please use a larger integer number <strong><em>n</em></strong> (<strong><em>n</em></strong> &lt; 2<sup>63</sup>) to output your result. Follow the format of the sample output.</p><hr /><div id=\"sampleinputoutput\"><table class=\"inputoutput\"><tr><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Input</h3></td><td class=\"SampleCaption\"><h3 style=\"text-align:left\">Sample Output</h3></td></tr><tr></tr><tr class=\"inputoutput\"><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">75  325&#13;\n5  120 &#13;\n100  255&#13;\n325  500&#13;\n.&#13;\n</pre></td><td class=\"inputoutput\" valign=\"top\"><pre class=\"sampleio\">220&#13;\n</pre></td></tr></table></div><hr /><table><tr><td>Keyword:</td><td></td></tr></table></div></body>\n</html><html xmlns=\"http://www.w3.org/1999/xhtml\"></html>"}